Revit 2027 API
BuiltInFailures.SystemsFailures.MismatchSystemType Property
 Cannot add [Element] to System. The System Type for the available connector does not match the System Type ([Type Name]) for the System.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchSystemType { get; }
Public Shared ReadOnly Property MismatchSystemType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchSystemType {
	FailureDefinitionId^ get ();
}
static member MismatchSystemType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SystemsFailures Class
Autodesk.Revit.DB Namespace